Tekla Open API Reference for Tekla Structures 2025
AnalysisModelHandler Methods
The AnalysisModelHandler type exposes the following members.
Methods
Name | Description
AddLoad
 Adds a load to the analysis model. The ConstructionMethod must be SELECTED_PARTS, SELECTED_PARTS_AND_LOADS or FLOOR_BY_SELECTED_PARTS_AND_LOADS.
AddPart
 Adds a part to the analysis model. The ConstructionMethod must be SELECTED_PARTS, SELECTED_PARTS_AND_LOADS or FLOOR_BY_SELECTED_PARTS_AND_LOADS.
GetActiveModel
 Gets the active model.
RemoveLoad
 Removes a load from the analysis model. The ConstructionMethod must be SELECTED_PARTS, SELECTED_PARTS_AND_LOADS or FLOOR_BY_SELECTED_PARTS_AND_LOADS.
RemovePart
 Removes a part from the analysis model. The ConstructionMethod must be SELECTED_PARTS, SELECTED_PARTS_AND_LOADS or FLOOR_BY_SELECTED_PARTS_AND_LOADS.
SetActiveModel
 Sets the active model. The AnalysisModelName or ID has to be set.
Top
See Also
Reference
AnalysisModelHandler Class
Tekla.Structures.Analysis Namespace